jpnorair/OpenTag/include/board/stm32l0xx/nucleo_STM32L053.h
// These are defined at FULL SPEED
#define BOARD_PARAM_AHBCLKDIV           1                       // AHB Clk = Main CLK / AHBCLKDIV
#define BOARD_PARAM_APB2CLKDIV          1                       // APB2 Clk = Main CLK / AHBCLKDIV
#define BOARD_PARAM_APB1CLKDIV          1                       // APB1 Clk = Main CLK / AHBCLKDIV

// SWD Interface: Nucleo used SWD in all cases, never JTAG.
// The SWO (Trace) pin is available, but not often used.
#define BOARD_SWDIO_PORT                GPIOA
#define BOARD_SWDIO_PINNUM              13
#define BOARD_SWDIO_PIN                 (1<<13)
#define BOARD_SWDCLK_PORT               GPIOA
#define BOARD_SWDCLK_PINNUM             14
#define BOARD_SWDCLK_PIN                (1<<14)
#define BOARD_TRACESWO_PORTNUM          1
#define BOARD_TRACESWO_PORT             GPIOB
#define BOARD_TRACESWO_PINNUM           (1<<3)
#define BOARD_TRACESWO_PIN              3

// SW1 is implemented on the TRACE Pin, active low
#define BOARD_SW1_PORTNUM               2                   // Port C
#define BOARD_SW1_PORT                  GPIOC
#define BOARD_SW1_PINNUM                13
#define BOARD_SW1_PIN                   (BOARD_SW1_PINNUM<<3)
#define BOARD_SW1_POLARITY              0
#define BOARD_SW1_PULLING               0

// TEST0, TEST1 pins are usually outputs but they could be pull-up inputs also
///@todo resolve these
#define BOARD_TEST0_PORTNUM             1                   // Port B
#define BOARD_TEST0_PORT                GPIOB
#define BOARD_TEST0_PINNUM              4
#define BOARD_TEST0_PIN                 (1<<4)
#define BOARD_TEST0_POLARITY            0
#define BOARD_TEST0_PULLING             1
#define BOARD_TEST1_PORTNUM             1                   // Port B
#define BOARD_TEST1_PORT                GPIOB
#define BOARD_TEST1_PINNUM              5
#define BOARD_TEST1_PIN                 (1<<5)
#define BOARD_TEST1_POLARITY            0
#define BOARD_TEST1_PULLING             1

// LED interface is implemented active-high (push) on PA0 & PA1
///@todo resolve these
#define BOARD_LEDG_PORTNUM              0                   // Port A
#define BOARD_LEDG_PORT                 GPIOA
#define BOARD_LEDG_PINNUM               1
#define BOARD_LEDG_PIN                  (1<<1)
#define BOARD_LEDG_POLARITY             1
#define BOARD_LEDO_PORTNUM              0                   // Port A
#define BOARD_LEDO_PORT                 GPIOA
#define BOARD_LEDO_PINNUM               0
#define BOARD_LEDO_PIN                  (1<<0)
#define BOARD_LEDO_POLARITY             1

// SPIRIT1 RF interface
///@todo this requires a patched RF bus intialization routine
#ifdef __USE_RADIO
#   define BOARD_RFGPIO_0PORTNUM           0        // GPIO0 on PA9 / "D8"
#   define BOARD_RFGPIO_0PORT              GPIOA
#   define BOARD_RFGPIO_0PINNUM            9
#   define BOARD_RFGPIO_0PIN               (1<<BOARD_RFGPIO_0PINNUM)
#   define BOARD_RFGPIO_1PORTNUM           0        // GPIO1 on PA8 / "D7"
#   define BOARD_RFGPIO_1PORT              GPIOA
#   define BOARD_RFGPIO_1PINNUM            8
#   define BOARD_RFGPIO_1PIN               (1<<BOARD_RFGPIO_1PINNUM)
#   define BOARD_RFGPIO_2PORTNUM           0        // GPIO2 on PA10 / "D2"
#   define BOARD_RFGPIO_2PORT              GPIOA
#   define BOARD_RFGPIO_2PINNUM            10
#   define BOARD_RFGPIO_2PIN               (1<<BOARD_RFGPIO_2PINNUM)
#   define BOARD_RFGPIO_3PORTNUM           1        // GPIO3 on PB5 / "D4"
#   define BOARD_RFGPIO_3PORT              GPIOB
#   define BOARD_RFGPIO_3PINNUM            5
#   define BOARD_RFGPIO_3PIN               (1<<BOARD_RFGPIO_3PINNUM)
#   define BOARD_RFCTL_PORTNUM             2        // SDN on PC7 / "D9"
#   define BOARD_RFCTL_PORT                GPIOC
#   define BOARD_RFCTL_SDNPINNUM           7
#   define BOARD_RFCTL_SDNPIN              (1<<BOARD_RFCTL_SDNPINNUM)
#   define BOARD_RFSPI_ID                  1        //SPI1
#   define BOARD_RFSPI_PORTNUM             0        //Port A
#   define BOARD_RFSPI_PORT                GPIOA    
#   define BOARD_RFSPI_MOSIPINNUM          7
#   define BOARD_RFSPI_MISOPINNUM          6
#   define BOARD_RFSPI_SCLKPINNUM          5
#   define BOARD_RFSPI_CSNPORTNUM          1        //Port B
#   define BOARD_RFSPI_CSNPORT             GPIOB
#   define BOARD_RFSPI_CSNPINNUM           6
#   define BOARD_RFSPI_MOSIPIN             (1<<BOARD_RFSPI_MOSIPINNUM)
#   define BOARD_RFSPI_MISOPIN             (1<<BOARD_RFSPI_MISOPINNUM)
#   define BOARD_RFSPI_SCLKPIN             (1<<BOARD_RFSPI_SCLKPINNUM)
#   define BOARD_RFSPI_CSNPIN              (1<<BOARD_RFSPI_CSNPINNUM)
#endif

// Main serial connections, used at least by MPIPE

// I2C on PB8/PB9 or "D15/D14"
#define BOARD_I2C_PORTNUM           1                       
#define BOARD_I2C_PORT              GPIOB
#define BOARD_I2C_ID                1
#define BOARD_I2C_SCLPINNUM         8
#define BOARD_I2C_SDAPINNUM         9
#define BOARD_I2C_SCLPIN            (1<<BOARD_I2C_SCLPINNUM)
#define BOARD_I2C_SDAPIN            (1<<BOARD_I2C_SDAPINNUM)

// UART on PA2/PA3 or "D1/D0"
#define BOARD_UART_PORTNUM          0
#define BOARD_UART_PORT             GPIOA
#define BOARD_UART_ID               1
#define BOARD_UART_TXPINNUM         2
#define BOARD_UART_RXPINNUM         3
#define BOARD_UART_TXPIN            (1<<BOARD_UART_TXPINNUM)
#define BOARD_UART_RXPIN            (1<<BOARD_UART_RXPINNUM)

// USB is always on PA11/A12
#define BOARD_USB_PORTNUM           0
#define BOARD_USB_PORT              GPIOA
#define BOARD_USB_DMPINNUM          11
#define BOARD_USB_DPPINNUM          12
#define BOARD_USB_DMPIN             (1<<BOARD_USB_DMPINNUM)
#define BOARD_USB_DPPIN             (1<<BOARD_USB_DPPINNUM)

// ADC Analog inputs on PA0,PA1,PA4,PB0,PC1,PC0 or "A0,A1,A2,A3,A4,A5"
#define BOARD_ADC_PINS                  6
#define BOARD_ADC_PORTS                 3
#define BOARD_ADC_0PORTNUM              0
#define BOARD_ADC_0PORT                 GPIOA
#define BOARD_ADC_0CHAN                 0
#define BOARD_ADC_0PINNUM               0
#define BOARD_ADC_0PIN                  (1<<BOARD_ADC_0PINNUM)
#define BOARD_ADC_1PORTNUM              0
#define BOARD_ADC_1PORT                 GPIOA
#define BOARD_ADC_1CHAN                 1
#define BOARD_ADC_1PINNUM               1
#define BOARD_ADC_1PIN                  (1<<BOARD_ADC_1PINNUM)
#define BOARD_ADC_2PORTNUM              0
#define BOARD_ADC_2PORT                 GPIOA
#define BOARD_ADC_2CHAN                 4
#define BOARD_ADC_2PINNUM               4
#define BOARD_ADC_2PIN                  (1<<BOARD_ADC_2PINNUM)
#define BOARD_ADC_3PORTNUM              1
#define BOARD_ADC_3PORT                 GPIOB
#define BOARD_ADC_3CHAN                 8
#define BOARD_ADC_3PINNUM               0
#define BOARD_ADC_3PIN                  (1<<BOARD_ADC_3PINNUM)
#define BOARD_ADC_4PORTNUM              2
#define BOARD_ADC_4PORT                 GPIOC
#define BOARD_ADC_4CHAN                 11
#define BOARD_ADC_4PINNUM               1
#define BOARD_ADC_4PIN                  (1<<BOARD_ADC_4PINNUM)
#define BOARD_ADC_5PORTNUM              2
#define BOARD_ADC_5PORT                 GPIOC
#define BOARD_ADC_5CHAN                 10
#define BOARD_ADC_5PINNUM               0
#define BOARD_ADC_5PIN                  (1<<BOARD_ADC_5PINNUM)



// Timer IO: these are multiplexed onto the IOBUS
///@todo convert these to PWM Nomenclature
#define BOARD_TIMA_PORTNUM              1
#define BOARD_TIMA_PORT                 GPIOB
#define BOARD_TIMA_ID                   3
#define BOARD_TIMA                      TIM3
#define BOARD_TIMA_CHANS                2
#define BOARD_TIMA_1CHAN                1
#define BOARD_TIMA_2CHAN                2
#define BOARD_TIMA_1PINNUM              4
#define BOARD_TIMA_2PINNUM              5
#define BOARD_TIMA_1PIN                 (1<<BOARD_TIMA_1PINNUM)
#define BOARD_TIMA_2PIN                 (1<<BOARD_TIMA_2PINNUM)
#define BOARD_TIMB_PORTNUM              1
#define BOARD_TIMB_PORT                 GPIOB
#define BOARD_TIMB_ID                   4
#define BOARD_TIMB                      TIM4
#define BOARD_TIMB_CHANS                4
#define BOARD_TIMB_1CHAN                1
#define BOARD_TIMB_2CHAN                2
#define BOARD_TIMB_3CHAN                3
#define BOARD_TIMB_4CHAN                4
#define BOARD_TIMB_1PINNUM              6
#define BOARD_TIMB_2PINNUM              7
#define BOARD_TIMB_3PINNUM              8
#define BOARD_TIMB_4PINNUM              9
#define BOARD_TIMB_1PIN                 (1<<BOARD_TIMB_1PINNUM)
#define BOARD_TIMB_2PIN                 (1<<BOARD_TIMB_2PINNUM)
#define BOARD_TIMB_3PIN                 (1<<BOARD_TIMB_3PINNUM)
#define BOARD_TIMB_4PIN                 (1<<BOARD_TIMB_4PINNUM)
#define BOARD_TIM
#define BOARD_TIMC_PORTNUM              1
#define BOARD_TIMC_PORT                 GPIOB
#define BOARD_TIMC_ID                   10
#define BOARD_TIMC                      TIM10
#define BOARD_TIMC_CHANS                1
#define BOARD_TIMC_1CHAN                1
#define BOARD_TIMC_1PINNUM              8
#define BOARD_TIMC_1PIN                 (1<<BOARD_TIMC_1PINNUM)
#define BOARD_TIMD_PORTNUM              1
#define BOARD_TIMD_PORT                 GPIOB
#define BOARD_TIMD_ID                   11
#define BOARD_TIMD                      TIM11
#define BOARD_TIMD_CHANS                1
#define BOARD_TIMD_1CHAN                1
#define BOARD_TIMD_1PINNUM              9
#define BOARD_TIMD_1PIN                 (1<<BOARD_TIMD_1PINNUM)




/** BOARD Macros (most of them, anyway) <BR>
  * ========================================================================<BR>
  * BOARD Macros are required by the OpenTag STM32L platform implementation.
  * We can assume certain things at the platform level, but not everything,
  * which is why BOARD Macros are required.
  *
  * If your board is implementing a radio (extremely likely), there are likely
  * some additional Board macros down near the radio configuration section.
  */


// AES Engine is only on STM32L06x
#define _CRYPCLK_N      0   //RCC_AHBENR_CRYPEN
#define _CRYPCLK_LP     0   //RCC_AHBSMENR_CRYPSMEN

// Random Number Generator is used by OpenTag, but only on-demand.  The driver
// must manage the clock bit
#define _RNGCLK_N       RCC_AHBENR_RNGEN
#define _RNGCLK_LP      RCC_AHBSMENR_RNGSMEN

// Touchscreen controller is not used by OpenTag, so the driver must manage it
// on-demand
#define _TOUCHCLK_N     0   //RCC_AHBENR_TOUCHEN
#define _TOUCHCLK_LP    RCC_AHBSMENR_TSCSMEN

//The built-in CRC engine is used by Opentag for many things, but never in sleep
#define _CRCCLK_N        RCC_AHBENR_CRCEN
#define _CRCCLK_LP       0       //RCC_AHBSMENR_CRCSMEN

// SRAM should always be clocked during SLEEP
#define _SRAMCLK_LP      RCC_AHBLPENR_SRAMLPEN

